ovidiurosu90/psh-portable-smart-hangboard/Arduino/MainControllerNodeMCU-32S/lib/ESP32-audioI2S-20240422/src/Audio.cpp
    uint8_t  p1, p2, p3, p4;
    boolean  found = false;
    uint32_t pos = resumeFilePos;
    audiofile.seek(pos);

    p1 = audiofile.read();
    p2 = audiofile.read();
    p3 = audiofile.read();
    p4 = audiofile.read();

    pos += 4;
    while(!found || pos >= m_fileSize) {
        if(p1 == 'O' && p2 == 'g'&& p3 == 'g' && p4 == 'S') {
            found = true;
            break;
        }
        p1 = p2;
        p2 = p3;
        p3 = p4;
        p4 = audiofile.read();
        pos++;
    }
    if(found) { log_w("out_resumeFilePos %i", pos - 4);    return (pos - 4);}
    stopSong();
    return 0;
}
//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
int32_t Audio::mp3_correctResumeFilePos(uint32_t resumeFilePos) {
/* this checks that the first 22 bits of the next frame header are the same as the current frame header, but it's still not foolproof
 * (could accidentally find a sequence in the bitstream which appears to match but is not actually the next frame header)
 * this could be made more error-resilient by checking several frames in a row and verifying that nSlots is the same in each case
*/
    boolean  found = false;
    uint32_t pos = resumeFilePos;
    uint32_t pos1 = 0, pos2 = 0;
    uint32_t maxPos = m_audioDataStart + m_audioDataSize;
    uint8_t byte1a, byte2a, byte3a;
    uint8_t byte1b, byte2b, byte3b;

    if(pos + 3 >= maxPos) goto exit;
    if(pos < m_audioDataStart) pos = m_audioDataStart;
    audiofile.seek(pos);

    while(!found){
        if(pos + 3 >= maxPos) goto exit;
        byte1a = audiofile.read(); pos++;
        byte2a = audiofile.read(); pos++;
        while(true){
            if(byte1a == 0xFF && (byte2a & 0x0E0) == 0xE0) {
                byte3a = audiofile.read(); pos++;
                pos1 = pos - 3; break;
            }
            byte1a = byte2a;
            byte2a = audiofile.read(); pos++;
            if(pos >= maxPos) goto exit;
        }
        // log_i("pos1 %i, byte1a %X, byte2a %X, byte3a %X", pos1, byte1a, byte2a, byte3a);

        if(pos + 3 >= maxPos) goto exit;
        byte1b = audiofile.read(); pos++;
        byte2b = audiofile.read(); pos++;
        while(true){
            if(byte1b == 0xFF && (byte2b & 0x0E0) == 0xE0) {
                byte3b = audiofile.read(); pos++;
                pos2 = pos - 3; break;
            }
            byte1b = byte2b;
            byte2b = audiofile.read(); pos++;
            if(pos >= maxPos) goto exit;
        }

        if((byte1a == byte1b) && (byte2a ==  byte2b) && ((byte3a & 0xFC) == (byte3b & 0xFC))){
            if(byte1a == 0xFF && byte2a == 0xFF && byte3a == 0xFF) found = false; // 0xFFFFFF can't be
            else found = true;
        }
    }
    (void) pos2;
    // log_i("found pos1=%i, pos2=%i", pos1, pos2);
    if(found) return (pos1);

exit:
    return -1;
}
//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
uint8_t Audio::determineOggCodec(uint8_t* data, uint16_t len) {
    // if we have contentType == application/ogg; codec cn be OPUS, FLAC or VORBIS
    // let's have a look, what it is
    int idx = specialIndexOf(data, "OggS", 6);
    if(idx != 0) {
        return CODEC_NONE;
    }
    data += 27;
    return CODEC_NONE;
}
//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

